//
//  Person.h
//  HYKit
//
//  Created by wuhaiyang on 2017/2/14.
//  Copyright © 2017年 wuhaiyang. All rights reserved.
//

#import "HYObject.h"

@interface Person : HYObject

{
    NSString *_sex;
}

#pragma mark - Types的格式为： 返回值@:参数1参数2参数3...
/**
 属性会自动生成setter和getter方法
 
 getter:
 2017-02-15 13:59:31.318 HYKit[8176:1576114] 方法名称：age
 2017-02-15 13:59:31.318 HYKit[8176:1576114] 方法的参数和返回值：i16@0:8
 2017-02-15 13:59:31.318 HYKit[8176:1576114] 方法的参数数量：2
 2017-02-15 13:59:31.318 HYKit[8176:1576114] 方法的参数描述：@
 2017-02-15 13:59:31.318 HYKit[8176:1576114] 方法的参数描述：:
 2017-02-15 13:59:31.318 HYKit[8176:1576114] 方法的返回值描述：i
 
 setter:
 2017-02-15 13:59:54.358 HYKit[8176:1576114] 方法名称：setAge:
 2017-02-15 13:59:54.358 HYKit[8176:1576114] 方法的参数和返回值：v20@0:8i16
 2017-02-15 13:59:54.358 HYKit[8176:1576114] 方法的参数数量：3
 2017-02-15 13:59:54.358 HYKit[8176:1576114] 方法的参数描述：@
 2017-02-15 13:59:54.358 HYKit[8176:1576114] 方法的参数描述：:
 2017-02-15 13:59:54.359 HYKit[8176:1576114] 方法的参数描述：i
 2017-02-15 13:59:54.359 HYKit[8176:1576114] 方法的返回值描述：v
 */
@property (nonatomic, assign) int age;


/**
 getter:
 2017-02-15 14:11:11.138 HYKit[8396:1641733] 方法名称：name
 2017-02-15 14:11:11.138 HYKit[8396:1641733] 方法的参数和返回值：@16@0:8
 2017-02-15 14:11:11.138 HYKit[8396:1641733] 方法的参数数量：2
 2017-02-15 14:11:11.138 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:11:11.138 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:11:11.139 HYKit[8396:1641733] 方法的返回值描述：@  //字符串也是一个对象，所有为 @
 
 setter:
 2017-02-15 14:14:01.419 HYKit[8396:1641733] 方法名称：setName:
 2017-02-15 14:14:01.419 HYKit[8396:1641733] 方法的参数和返回值：v24@0:8@16
 2017-02-15 14:14:01.419 HYKit[8396:1641733] 方法的参数数量：3
 2017-02-15 14:14:01.419 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:14:01.419 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:14:01.419 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:14:01.420 HYKit[8396:1641733] 方法的返回值描述：v
 
 */
@property (nonatomic, copy) NSString *name;


/**
 getter:
 2017-02-15 14:14:26.956 HYKit[8396:1641733] 方法名称：height
 2017-02-15 14:14:26.956 HYKit[8396:1641733] 方法的参数和返回值：d16@0:8
 2017-02-15 14:14:26.956 HYKit[8396:1641733] 方法的参数数量：2
 2017-02-15 14:14:26.956 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:14:26.957 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:14:26.957 HYKit[8396:1641733] 方法的返回值描述：d
 
 setter:
 2017-02-15 14:14:51.717 HYKit[8396:1641733] 方法名称：setHeight:
 2017-02-15 14:14:51.718 HYKit[8396:1641733] 方法的参数和返回值：v24@0:8d16
 2017-02-15 14:14:51.718 HYKit[8396:1641733] 方法的参数数量：3
 2017-02-15 14:14:51.718 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:14:51.718 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:14:51.718 HYKit[8396:1641733] 方法的参数描述：d
 2017-02-15 14:14:51.718 HYKit[8396:1641733] 方法的返回值描述：v

 */
@property (nonatomic, assign) double height;


/**
 getter:
 2017-02-15 14:12:39.371 HYKit[8396:1641733] 方法名称：weight
 2017-02-15 14:12:39.371 HYKit[8396:1641733] 方法的参数和返回值：d16@0:8
 2017-02-15 14:12:39.371 HYKit[8396:1641733] 方法的参数数量：2
 2017-02-15 14:12:39.372 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:12:39.372 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:12:39.372 HYKit[8396:1641733] 方法的返回值描述：d

 setter:
 2017-02-15 14:10:20.389 HYKit[8396:1641733] 方法名称：setWeight:
 2017-02-15 14:10:20.389 HYKit[8396:1641733] 方法的参数和返回值：v24@0:8d16
 2017-02-15 14:10:20.389 HYKit[8396:1641733] 方法的参数数量：3
 2017-02-15 14:10:20.390 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:10:20.390 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:10:20.390 HYKit[8396:1641733] 方法的参数描述：d
 2017-02-15 14:10:20.390 HYKit[8396:1641733] 方法的返回值描述：v
 */
@property (nonatomic, assign) double weight;


//@property (nonatomic, strong) NSArray *sArray;
//
//@property (nonatomic, weak) NSArray *wArray;

/**
 2017-02-15 14:12:55.977 HYKit[8396:1641733] 方法名称：run
 2017-02-15 14:12:55.977 HYKit[8396:1641733] 方法的参数和返回值：v16@0:8
 2017-02-15 14:12:55.977 HYKit[8396:1641733] 方法的参数数量：2
 2017-02-15 14:12:55.977 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:12:55.978 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:12:55.978 HYKit[8396:1641733] 方法的返回值描述：v
 */
- (void)run;


/**
 2017-02-15 14:08:32.208 HYKit[8396:1641733] 方法名称：eat
 2017-02-15 14:08:32.209 HYKit[8396:1641733] 方法的参数和返回值：v16@0:8
 2017-02-15 14:08:32.209 HYKit[8396:1641733] 方法的参数数量：2
 2017-02-15 14:08:32.209 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:08:32.209 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:08:32.209 HYKit[8396:1641733] 方法的返回值描述：v
 */
- (void)eat;


/**
 2017-02-15 14:08:38.610 HYKit[8396:1641733] 方法名称：addCalculateWithNum1:num2:
 2017-02-15 14:08:38.610 HYKit[8396:1641733] 方法的参数和返回值：i24@0:8i16i20
 2017-02-15 14:08:38.610 HYKit[8396:1641733] 方法的参数数量：4
 2017-02-15 14:08:38.610 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:08:38.610 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:08:38.611 HYKit[8396:1641733] 方法的参数描述：i
 2017-02-15 14:08:38.611 HYKit[8396:1641733] 方法的参数描述：i
 2017-02-15 14:08:38.611 HYKit[8396:1641733] 方法的返回值描述：i
 */
- (int)addCalculateWithNum1:(int)num1 num2:(int)num2;


#pragma mark - class_copyMethodList -- 获取所有的方法列表；如果class为类，获取的是实例方法列表，如果class是元类，获取的是类方法列表！！！

/**
 2017-02-15 14:26:15.416 HYKit[8819:1758318] 方法名称：swim
 2017-02-15 14:26:15.416 HYKit[8819:1758318] 方法的参数和返回值：v16@0:8
 2017-02-15 14:26:15.416 HYKit[8819:1758318] 方法的参数数量：2
 2017-02-15 14:26:15.416 HYKit[8819:1758318] 方法的参数描述：@
 2017-02-15 14:26:15.417 HYKit[8819:1758318] 方法的参数描述：:
 2017-02-15 14:26:15.417 HYKit[8819:1758318] 方法的返回值描述：v
 */
+ (void)swim;

/*
 2017-02-15 14:10:50.978 HYKit[8396:1641733] 方法名称：.cxx_destruct
 2017-02-15 14:10:50.978 HYKit[8396:1641733] 方法的参数和返回值：v16@0:8
 2017-02-15 14:10:50.978 HYKit[8396:1641733] 方法的参数数量：2
 2017-02-15 14:10:50.979 HYKit[8396:1641733] 方法的参数描述：@
 2017-02-15 14:10:50.979 HYKit[8396:1641733] 方法的参数描述：:
 2017-02-15 14:10:50.979 HYKit[8396:1641733] 方法的返回值描述：v
 */


@end
